#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <memory.h>
#include <sys/stat.h>
#include <sys/types.h>
#include<stdint.h>
/////////////////////這個header是給hoouses.bmp儲存他的header用的//////////
typedef struct Bmpheader {
	char identifier[2]; // 0x0000
	unsigned int filesize; // 0x0002
	unsigned short reserved; // 0x0006
	unsigned short reserved2;
	unsigned int bitmap_dataoffset; // 0x000A
	unsigned int bitmap_headersize; // 0x000E
	unsigned int width; // 0x0012
	unsigned int height; // 0x0016
	unsigned short planes; // 0x001A
	unsigned short bits_perpixel; // 0x001C
	unsigned int compression; // 0x001E
	unsigned int bitmap_datasize; // 0x0022
	unsigned int hresolution; // 0x0026
	unsigned int vresolution; // 0x002A
	unsigned int usedcolors; // 0x002E
	unsigned int importantcolors; // 0x0032
	unsigned int palette; // 0x0036
} Bitmap;

///////////////////儲存輸入檔案的data/////////////////////
typedef struct Gray{
	int R;
	int G;
	int B;
} ImgGray;

/////////////////用於儲存YCbCr///////////////////////
typedef struct _YCbCr{
	double Y;
	double Cb;
	double Cr;

  short QY;
  short QCb;
  short QCr;

  float eY;
	float eCb;
	float eCr;

  int rY;
  int rCb;
  int rCr;

  double rrY;
  double rrCb;
  double rrCr;
}YCbCr;

////////////fast/////////////////////////////////////////
YCbCr** mal_2D(YCbCr **array,int x,int y){
	array=(YCbCr**)malloc(sizeof(YCbCr*)*x);
	for(int i=0;i<x;i++){
		array[i]=(YCbCr*)malloc(sizeof(YCbCr)*y);
	}
	return array;
}
//創建一個函數用於free
void free_2D(YCbCr **array,int x){
	for(int i=0;i<x;i++)
		free(array[i]);
	free(array);
}
YCbCr* mal_1D(YCbCr *array,int x){
	array=(YCbCr*)malloc(sizeof(YCbCr)*x);
	return array;
}
////////////////////////////main function//////////////////////////////////
